20240504T133130--kdoc-161-kdocの目的__essay.org
:properties:
:ID: 20240504T133130
:mtime:    20241102180319 20241028101410
:ctime:    20241028101410
:end:
#+title:      KDOC 161: KDOCの目的
#+date:       [2024-05-04 Sat 13:31]
#+filetags:   :essay:
#+identifier: 20240504T133130

* この文書のステータス
- 作成
  - [X] 2024-05-05 貴島
- レビュー
  - [X] 2024-05-11 貴島

* 目的
ドキュメントをうまく利用できてない感じがする。KDOCの目的を明確にする。

- 説明を通して、理解を試し、より高い理解を得ること

  説明して理解を試す。より高い理解を得る。そして、未来の自分が読んで思い出せるようにする。

- 自分の考えを整理し、自分で批判を加え強化する

  個人的考察を発展させる。エッセイを許容するが感想は不可。

- 組み合わせてアイデアを得ること

  ツェッテルカステンの本に書いてあったからこの目的にしているだけで、分野的にあまり組み合わせることを具体的に考えられていない。研究ではないから、あまり新しいアイデアという視点がない。

* 関連
- [[id:20231008T203658][KDOC 36: 『TAKE NOTES!』]]。ツェッテルカステンのやり方の参考にしている本
- [[id:20240204T105547][KDOC 71: KDOCエントリの書き方]]。KDOCに関する言及
- [[id:20240502T172812][KDOC 153: すでにあるメモから、関連させられないか考える]]。同じく現状のドキュメントの問題点を考えている
- [[id:20240502T173223][KDOC 154: 悪いメモの例]]。同じく現状のドキュメントの問題点を考えている
