20240504T133130--kdoc-161-kdocの目的__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-10-31 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 161: KDOCの目的</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 161: KDOCの目的</h1>

<div id="outline-container-org3830a6b" class="outline-2">
<h2 id="org3830a6b"><a href="#org3830a6b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org3830a6b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-05 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-11 貴島</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb7870f7" class="outline-2">
<h2 id="orgb7870f7"><a href="#orgb7870f7">目的</a></h2>
<div class="outline-text-2" id="text-orgb7870f7">
<p>
ドキュメントをうまく利用できてない感じがする。KDOCの目的を明確にする。
</p>

<ul class="org-ul">
<li><p>
説明を通して、理解を試し、より高い理解を得ること
</p>

<p>
説明して理解を試す。より高い理解を得る。そして、未来の自分が読んで思い出せるようにする。
</p></li>

<li><p>
自分の考えを整理し、自分で批判を加え強化する
</p>

<p>
個人的考察を発展させる。エッセイを許容するが感想は不可。
</p></li>

<li><p>
組み合わせてアイデアを得ること
</p>

<p>
ツェッテルカステンの本に書いてあったからこの目的にしているだけで、分野的にあまり組み合わせることを具体的に考えられていない。研究ではないから、あまり新しいアイデアという視点がない。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org89753a1" class="outline-2">
<h2 id="org89753a1"><a href="#org89753a1">関連</a></h2>
<div class="outline-text-2" id="text-org89753a1">
<ul class="org-ul">
<li><a href="20231008T203658--kdoc-36-『take-notes』__book.html#ID-20231008T203658">KDOC 36: 『TAKE NOTES!』</a>。ツェッテルカステンのやり方の参考にしている本</li>
<li><a href="20240204T105547--kdoc-71-kdocエントリの書き方__essay.html#ID-20240204T105547">KDOC 71: KDOCエントリの書き方</a>。KDOCに関する言及</li>
<li><a href="20240502T172812--kdoc-153-すでにあるメモから、関連させられないか考える__essay.html#ID-20240502T172812">KDOC 153: すでにあるメモから、関連させられないか考える</a>。同じく現状のドキュメントの問題点を考えている</li>
<li><a href="20240502T173223--kdoc-154-よくないメモの例__essay.html#ID-20240502T173223">KDOC 154: 悪いメモの例</a>。同じく現状のドキュメントの問題点を考えている</li>
</ul>
</div>
</div>


<div id="outline-container-org1a1e716" class="outline-2">
<h2 id="org1a1e716"><a href="#org1a1e716">Backlinks</a></h2>
<div class="outline-text-2" id="text-org1a1e716">
<ul class="org-ul">
<li><a href="./20240504T224810--kdoc-165-メモの課題と対応策__structure.html">KDOC 165: メモの課題と対応策</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
